package com.ly.mall.common.api;

/**
 * 接口名：IErrorCode
 * 功能说明：
 * 封装API的错误码
 * ***********************************************************************
 *
 * @author 创建人：ly
 * @version 版本号：V1.0
 * **************************修订记录*************************************
 * <p>
 * 2019/12/21 15:31   ly   创建该类功能。
 * <p>
 * **********************************************************************
 * @date 创建日期：2019/12/21 15:31
 */
public interface IErrorCode {
    long getCode();

    String getMessage();
}
